{"review_id":{"923":"UBQZ6DJjLZPRff7Y60HxSw","8689":"W6CEMRvUULe_VKtFxO1Xwg","11992":"YUzb5S7L1xGr9Bz9u2Ddtw","490":"l7NlnD8wDEjYnjjs_iiRNQ","3050":"d4ovBbHflkYLVl8IazXxWg","6792":"hwu2eaQJKlY6E_uFscLpVA","677":"Ajzgqia8h58U1gVEvajPew","14715":"qeQIl1egLguw30Ki1QWgYw","5568":"BBCLoKlJDjLayKNRNN7lgQ","12454":"mCFHLk2OzrP2gHKxm6xwbA","3764":"zezlMLNf_0xYPuisVTxfrg","6410":"R8zl-4IdxCI91x8gf4QaYQ","1059":"nu7rFvDdsK52njivMbPo_g","13330":"Zy-L6qJJ-udxvn3L7RIq8w","5776":"YpRWCX4KSZArxccGeeAKug","7376":"uQdjpSvSImfgATH8u-r7FA","14229":"Mh913Crajz52pFP9czap0Q","6023":"uBn4S02MxFg0yriZfe2Ydw","3383":"iVe-0l81Yj2_KFzs_i3FFg","1850":"9Czm7V0qrzdEqCwZuSGcHQ","7345":"TR_X51cvZHJtOosizCdVyA","9888":"YDnlV-wmjF7MKK9S6LYasg","1656":"35tPYJR2VlRhDywTmFoE-w","14148":"dAa0NCCv4JtZU5dAHfjZgA","12957":"OOdxQcGBDTesPPXWFPX5vQ","2823":"AghC4O87C-N58Ca9Qg8fsw","3276":"GPDflufm2aWOX2bsz_dj7Q","3973":"oMJSGS16DyCsqgaXQGRZuw","7010":"EVAIaOGRQw2Jp5os1gQFaw","12940":"jcbHPpwJLP4uADiRLKOidA","1410":"zmSYh4xSsQ-3GhGuVmamUw","8026":"3Cl3sJQQNxmDta0LJh8Hrw","10850":"2RfHRdgwGW9qkKJz4QN4PQ","874":"yUbisfra5W5FZJMVpswsig","10689":"7Hi8rwyB3LwqWS-Ctb9Jwg","13965":"Zg95WW_dS8tyUTiI_qa6cQ","10525":"U4PSlEiuM4gplRKfm0XYeA","11116":"id7CGCfMgvw8N8hl57JiFg","6537":"DaUfBMQ9cbc8p9YY_F1Atg","242":"QvnSwG5rLldGkZj9CbEaqQ","15195":"UIyz_DrmP2MumG2ZpdA3Lg","6906":"sZWoZ-lZf7iKQIBCxnsgRA","10842":"mUhCijzCzsrckg4V4083VQ","4264":"7WcOyCrbLquiNSOTqW9RTw","12968":"BapNH4q-vHp662HfuOHJWA","8949":"SICFFFD1ZZ1zQLWoMsWzGg","3763":"77yfRheDqWo4qkBLNJoluA","4282":"hbaSidJITwgv_z_QYgBiVg","1333":"2eC4EmJ6KIeIXYBV7TdlDw","4872":"uy7XQTZ6Hjfzw47K6U65Mw"},"user_id":{"923":"Hj_GF8MnikDy4BQzf0B8Dg","8689":"d7CK2tNS7mwwR-MlSjs23w","11992":"UXAey1qMy09tbMJL2uugYQ","490":"0b3CfmDNYdFKzTLAmfJjVg","3050":"_dJ3UBWisrY0qsGDRk6lgQ","6792":"tljGkKF-knendFJ-51kw8g","677":"9cwC-zXHHCu9Pjn3310smw","14715":"NeoLmQPhHpZxCJZjAFnF6Q","5568":"IXMVqUmhG6VgczNFieK7Qw","12454":"X6ZYcQj7bHLJ15DJ5SziWg","3764":"e9U1_KJnd4Ea9sRd4TZqWA","6410":"LT0-OUJncSGOcjMTd7bUAg","1059":"aoMCtjQglIGz7V3a2m74tA","13330":"kJb0LXFpCBwVkYhnbforDg","5776":"wBd7M2e6-dWDOQD_0eMTCQ","7376":"fddXX6wyUO8rvx3w8-Ykmw","14229":"SMfwxBhGuhz1sEL5Wd-i2w","6023":"pXdxhamXOcY4rMjxVFTAgA","3383":"ko-PpGD_qDxL-TdJZBnGmA","1850":"y00vwHvQ2c3oY3UbdLqZ8w","7345":"0Bc8KXmWE3v0xfNjRhLSNA","9888":"D9PzCeQl9cHaMb6784eN_w","1656":"dleljvQBajblbQPwRvT3oA","14148":"opDy63kJeYkb9OMviAe_Ag","12957":"WJl9x81yWP7-aO-CfNTksw","2823":"Lsbcp7XZnL3Wz418Z4xsIw","3276":"rR1-mOhoXDZAeyRGZG-vcA","3973":"jboKypB_6Ob_3DqijWWjHQ","7010":"vt_1zskDK5iu50MT9LIUDA","12940":"JUbShoeYLmk76Q1n9yv9wQ","1410":"33K9oda3-Z9_iqGyPPTtGQ","8026":"XPNiTbrKL7f0_6L0lrbZlg","10850":"RGyrosdcr8fDaJwr2ZZ4Og","874":"fovP1E2wGBXS7JEkX9CqmA","10689":"38pRZnT8LKtKwjYn9SFeKA","13965":"nEDYH88buw_aAkrRLvNP-g","10525":"1PmabnjSGmtg7MFZJKCLKA","11116":"jFqQT_PS4kRhBChcO05VDg","6537":"YLyFQ9VVBoqqPIiUeDvVZw","242":"p9vQv6dhU9NufSzsIAlrGg","15195":"gDroxp_ByWfd7255Z5Rf5w","6906":"YgAvF0-yD9KUQU9oU2nbLw","10842":"Rs7wnZX80x2MjcULtVhfsg","4264":"HYJnchzT2YtnGg4E6IchxA","12968":"t9PqL7ghTDnDmJxmOkTLSw","8949":"1R7BMiTuBXzVHpNsb0Xhgw","3763":"Wj09aDcfa5ESkDWEueU4Vw","4282":"kmhGLUyByh_apgVTFulC2g","1333":"DJpQYM2AcR9UXq3MFQg65Q","4872":"pl9GHUSN4n_Fiuhnczv7EA"},"business_id":{"923":"z8Em-bhZI3Mmspml7tj6tg","8689":"WO3L0pmtAO8ozspmaVdHIg","11992":"nN1MXnHFzZh9snkMmdhYrg","490":"793LPDn8axywoOANbDeAZw","3050":"dcrL22ant20s1thjdVGhLw","6792":"YgWGWza3sXzI0brcOogR5A","677":"QeEQXdto_4wFRaNKyIygRA","14715":"etzDsNjkCyQBoJcU2a3U-g","5568":"yHHVKa9joZAKiBDUp2SkKw","12454":"d8Kz48UDfZ0MPuQpGy2r0Q","3764":"yAkaDc6MWX3dy8bnEcCrRQ","6410":"sj9osyqLyOy7b_kDZb1txA","1059":"pJnN5PxqFPGZW2pJWkQtzA","13330":"IBYExgJ6jURNJOk_5uSrKg","5776":"GwKq3kjkFXhbBMAwe4H3rg","7376":"0kPm1zEpeXFRg8D2phqgCQ","14229":"R43QH4FqHOOJapm5TaCEVg","6023":"x3LoVFuzVIPK_J-kDZORdg","3383":"Rii85bzYKGC9P0zOyAem6A","1850":"vxuyl9IVum8zngXgvbT4Jg","7345":"3kUqNxO1rkDDb89GAfyNgw","9888":"GUsYtGG557XKlHaMH87erg","1656":"7e3PZzUpG5FYOTGt3O3ePA","14148":"shIPnFoXrL3dFo5HLH1_HA","12957":"yEZn1XpLsEC9uBa-X4xAZw","2823":"CQxhyLM833WF45yrS9yeAA","3276":"1Fpk8ibHhZYnCw8fnGny8w","3973":"grvkjaJB9aorAMIjGD6XSg","7010":"JiNtFt02pLvjXkqxZL737Q","12940":"WA7sC64kCRstywm2EgZXEw","1410":"hXzoNgpkC86K_Jfg_zMHvA","8026":"y5fwt6pAKnvYOSn-xOUepA","10850":"2ALnrUa1_U8JHNgscad8OQ","874":"j7HO1YeMQGYo3KibMXZ5vg","10689":"Ai-GviVpPlti74NtM8y9QQ","13965":"oLb3-eXUFtCFJl2DuBhcvA","10525":"0Rni7ocMC_Lg2UH0lDeKMQ","11116":"rN3gHTjqx5sOnoUpJ-6jyg","6537":"Jol7cXrDmKKmu_V6qp4wMA","242":"ZBE-H_aUlicix_9vUGQPIQ","15195":"AT-og6IROn0hJt-HR5Njlw","6906":"cOY6ipigtTXdcmmmiFiniA","10842":"ZhACHVw9k438Z3i-Gw9BHA","4264":"NdpvGGF4cLrdnA6ydSZz3g","12968":"z_RTK0MaxaRHRQ99hDL2QA","8949":"dhBAQJLKPCI7nm3x0WjXTw","3763":"spDZkD6cp0JUUm6ghIWHzA","4282":"KjjNv4YFzBFnsBh2ncH1Iw","1333":"vuHzLZ7nAeT-EiecOkS5Og","4872":"84DjKzaR26vphu9fNI9nKg"},"stars":{"923":1,"8689":1,"11992":1,"490":1,"3050":1,"6792":1,"677":1,"14715":1,"5568":1,"12454":1,"3764":1,"6410":1,"1059":1,"13330":1,"5776":1,"7376":1,"14229":1,"6023":1,"3383":1,"1850":1,"7345":1,"9888":1,"1656":1,"14148":1,"12957":1,"2823":1,"3276":1,"3973":1,"7010":1,"12940":1,"1410":1,"8026":1,"10850":1,"874":1,"10689":1,"13965":1,"10525":1,"11116":1,"6537":1,"242":1,"15195":1,"6906":1,"10842":1,"4264":1,"12968":1,"8949":1,"3763":1,"4282":1,"1333":1,"4872":1},"useful":{"923":2,"8689":0,"11992":11,"490":0,"3050":1,"6792":1,"677":0,"14715":0,"5568":0,"12454":4,"3764":2,"6410":3,"1059":0,"13330":0,"5776":0,"7376":0,"14229":2,"6023":0,"3383":0,"1850":0,"7345":1,"9888":0,"1656":4,"14148":0,"12957":0,"2823":9,"3276":1,"3973":1,"7010":0,"12940":0,"1410":0,"8026":1,"10850":1,"874":0,"10689":0,"13965":0,"10525":0,"11116":0,"6537":3,"242":0,"15195":1,"6906":2,"10842":0,"4264":2,"12968":0,"8949":1,"3763":1,"4282":3,"1333":2,"4872":0},"funny":{"923":1,"8689":1,"11992":1,"490":2,"3050":1,"6792":0,"677":1,"14715":0,"5568":0,"12454":0,"3764":3,"6410":0,"1059":1,"13330":0,"5776":1,"7376":0,"14229":1,"6023":0,"3383":0,"1850":0,"7345":0,"9888":3,"1656":2,"14148":0,"12957":0,"2823":0,"3276":1,"3973":0,"7010":0,"12940":0,"1410":0,"8026":1,"10850":0,"874":0,"10689":2,"13965":0,"10525":0,"11116":0,"6537":0,"242":0,"15195":0,"6906":2,"10842":0,"4264":0,"12968":0,"8949":2,"3763":0,"4282":1,"1333":3,"4872":0},"cool":{"923":1,"8689":0,"11992":3,"490":0,"3050":0,"6792":0,"677":0,"14715":0,"5568":0,"12454":0,"3764":0,"6410":0,"1059":0,"13330":0,"5776":0,"7376":0,"14229":0,"6023":0,"3383":0,"1850":0,"7345":0,"9888":0,"1656":0,"14148":0,"12957":0,"2823":2,"3276":0,"3973":0,"7010":1,"12940":0,"1410":0,"8026":1,"10850":0,"874":0,"10689":0,"13965":0,"10525":0,"11116":0,"6537":1,"242":0,"15195":0,"6906":0,"10842":0,"4264":1,"12968":0,"8949":0,"3763":0,"4282":1,"1333":1,"4872":0},"text":{"923":"We were starving and it was the only reasonably priced place open at 9:30pm in Northern Scottsdale.  The brisket was edible and the sides were mediocre.","8689":"Wow, people in Las Vegas must be on crack to give this place 3 stars. My 1 star is being generous. \n\nI stayed at the Freemont last year and on the first day just wanted to grab something quick to eat so I got some chinese food from here. This is the worst chinese food I have ever eaten. The egg rolls were disgusting. Actually, everything they served was disgusting. I ended up throwing the food away. \n\nAvoid this place at all cost. You better off starving to death then eating here.","11992":"I went in with my friend and was a bit hesitant because I didn't know what to expect...we were greeted and offered water (it was a bit funny though, when my girlfriend made the appointment she spelled out her name, and when we got there they still had it wrong).  So they took her back and I waited a couple of minutes for my stylist.\n\nOK - I had a good experience...but the overall tone of this place is just not good!  All the responses from our reviews have been negative.\n\nHowever, my friend had the exact opposite expereince.  She wasn't offered wine and her stylist didn't flat iron her hair in small pieces like she had asked.  \n\nOf course I felt bad because this was my friend's idea and I went along and had a great time...wish there was a way to make it a great experience for all!\n\nPS - I revised my review and the owner had it removed.  This place is LIMP and FLAT!  Please don't waste your money here...go where you are appreciated!  I gave the a ONE star b\/c the owner's attitude toward my friend was RUDE!  I can't believe in the economy that people would even take that approach.","490":"The only reason I'm giving this place a one star is because of Michele, who took the time to talk to me. Apparently the owners dad seems to think he runs the place! He was a total jerk to the employees... there was only two people in line, and one lady didn't have a clue as to what she wanted yet. This jerk decided to show off for his golf buddies and go behind the counter and yell at the staff! Unfortunately, I had already placed and paid for my order or I would've walked out! This guy was a total jackass!","3050":"Over priced with mediocre food. I ordered a brisket and two beers for my dinner. The brisket was dry, the brioche buns that came along were cold and the beer was $9 each!","6792":"I had to say I have a really poor treatment with Dee for Dentist. \n\nThe treatment did by Dee caused me 9 months root soreness and additional $3000 as well as the days I had to take off for another dentist. very disappointed\n\nOct of Last year, I went to a hike and broke my two teeth, at the time I needed emergency treatments, my friend took me here, Dee was very very nice and did the root canal for me. I was truly thankful at the time. \n\nI had to do the crown after back to Shanghai, here is the nightmare, after I did the crown, my teeth were sore for 9 months, what caused the soreness was because Dee put the root too long. \n\nI had to take off the crown, redo the root carnal , the whole thing was a nightmare\n\nI really appreciate the fact that Dee took time to show up on an emergency call but all the suffering and additional cost and additional time i had to spent on this  after the root carnal treatment was a nightmare. I didn't expect that I had to take off my crowns and restart the whole thing after I spent $3000 because of the root carnal treatment. and what worse was my health insurance doesn't cover the re-treatment because it was out of 3 months window so I had to pay from my own pocket\n\nI hope in future Dee can do better with whatever treatment she does, and what happened to me will never happen to anybody else","677":"Visited on Friday 3\/25 for supper. I was really looking forward to a good Cajun meal. Out of fish on a Friday????  Are you kididng? And, crab soup so salty, was not edible. The waitress, who was really good, did not charge for it after complaining. Rice and beans pretty good, and wait staff quite attentive. I really did expect better. Will not be going there again.","14715":"The food was so nasty it made us sick\n\nEggs were watery with cheese burnt on top\n\nHash browns were rock hard \n\nEverything was just horrible\n\nService was so good the staff was super good staff was super nice wish I could say the same about the food","5568":"Made me leave my beer to go to the bathroom. Been roofied by so many bartenders and employees not a good look. Prob won't be returning","12454":"I have attempted to eat at Kost twice. I wouldn't give them any stars if i had the choice.\n\nThe first time i had a reservation for my birthday brunch on a Sunday at 1pm for 14 people. My husband called at 830 am that day to cancel the reservation as the city of Toronto was experiencing an ice storm and was on an extreme storm watch and was told not to leave your house. The manager told us she was going to charge our credit card 25$ per person for cancelling less the  24 hours, even though mother nature was not on our side and it was not safe to be on the roads. While i understand the cancellation policy they should have been understanding of the unsafe weather conditions that were out of our hands.\n\nToday my family and I decided to make a last minute reservation and have lunch at Kost. \n\nWe arrived and were seated. Two of us used the restroom and in the mean time we were told they wouldnt serve us until all guests were seated. Once we were all at the table a good 15 minutes passed without anybody greeting us at our table. We asked a waitress if we could get served and she rudely told us she was not serving our table. She came back 5 minutes reiterating that she was not our server but will do us a favour and punch in our food, but we didn't need any favours and decided to leave. As we were on our way out we spoke to the manager, who was chewing food with her mouth full as she tried to apologize for the lack of service. She also mentioned that she had just started...are you working or not?  Behind her were at least 6 other servers also eating enjoying their meals while we were not. Does Kost or Bisha not provide breaks or areas to eat for their staff?\n\nNeither of these experiences would ever make me come back or recommend to a friend.\n\nIf you want to eat some good food, with great service and a cool atmosphere go to La Carnita on John street.","3764":"Absolutely THE worst!  This place won \"Best of Madison\" for Chinese food for how many years??? The judge must have been completely stoned out of his mind! \nCustomer service:  Very poor.  The server never checked back until I went looking for her, wondering where our order was 50 minutes after ordering. \nFood finally arrived for our group of four--STONE COLD!  Plates themselves were hot but practically frostbite on the food.  Couldn't eat it. \nManager came by, apologized and took 50% off the bill (!!!). Should have been 100% comped. \nI'm one of those folks who normally overlooks a lot and actually hates to complain, but this culinary travesty really needed to be reported.  If this place previously had great food and service, then as of 2014 they've completely lost their \"mojo\".","6410":"This place is a joke. I paid $52.00 for two pizzas that were in no way related to the city of Chicago. The only thing worse than the pizza was the service. I understand that the place just opened, but the staff seemed incompetent. The cheese has a sour taste and the guys in the back must be cutting back on the topping because they only put  8 pepperoni on a family size pizza. Oh and it took 45 minutes to make a two pies. My family and I will not be returning and I will not be recommending this place to my friends and family.","1059":"Save your money and time. Overpriced gross food. You'll need about a gallon of water after eating here. Not sure if it's too much soy sauce, salt, MSG, or what... But it is not pleasant. They have the worst miso soup I've ever tasted. Steer clear of this place.","13330":"Asked for Teriyaki Chicken w\/Lo Mein noodles, got regular chicken with angel hair noodles. No Crab Rangoons. Over priced, sub-par food. Would NOT recommend.","5776":"My first time in Las Vegas. Went with my husband and another couple. We were told to go to the staff guest list and that we will get in for free before a certain time. The event was at Encore pool party 8\/2\/2017.\n\nWe got there and as soon as we got towards the front, we were told it'll be $55 a person!!! That's over $200!\n\nWe ended up leaving as that money would've been better off towards gambling and drinks.\n\nOur \"promoter\" was MICHELLE. Thanks a lot for wasting our time and Uber money. What a waste and so unprofessional. Give us the details instead of half-ass. Geez!!\n\nNever again!","7376":"This location is horrible! Wait is always minimum of 20 minutes! They always get something wrong with the orders and once I even found a long piece of plastic in my coffee!","14229":"We came in on Saturday at 11:00a and asked if we could have an early check-in and was denied... we were told that possibly we could be in the room by 3:00p (since I need to get ready for my Wedding). We ended up not getting into the rooms till the check in at 4:00p... which okay.. understandable!\n\nHowever, one of our rooms bathtubs jets didn't work, had a lot of mold inside the jet areas and surrounding the rings to them. The pull out bed from the couch was broken at the end... when we went swimming we found out that another couple had come in same day at 2:00p and received an early check in before 3:00p?!?!? The pool maintenance gentleman said he was cleaning the pools and left (never seen him after that... we were in the hot tub for a long time). \n\nWe requested a late checkout and was told YES by the lady at the front desk and when I called and confirmed later that night (agreeing to pay extra) I was denied and told I would be charge full price and tax if we weren't out by 10:00a (what hotel kicks you out that early?!?) \n\nThe towels were not completely washed because when I unfolded one of them it had really sketchy streaks on it..","6023":"The customer service was terrible and the food made my friend sick. We waited for our drinks for 30 minutes and then didn't get our food for an hour. The food was nothing special and my friend threw up the tacos she ate later that night. I will never go again.","3383":"Ordered prime rib, a baked potato mushrooms and a side of rice. The prime rib was so tough I could not cut through it. I stuck my fork in it and I couldn't get my fork out. I never received my mushrooms. The food was delivered and no one ever came back to check and see if everything was ok. The worst dining experience I've had in a very long time.","1850":"Never been to Freddy's before, so I thought I'd check it out. They have all kinds of ice cream and custard, which actually looks good, but I didn't try the desserts. I got the Original Double burger. It looked big in the picture. The patties are actually hammered down into thin meat wafers. They stick out of the bun by about an inch all the way around, but they are super thin and crispy. I'm more of a juicy burger type person, so I thought the burgers here sucked. No flavor and dry.","7345":"Short version: worst massage ever. \nLonger version...\nThings started off with them 20 minutes behind schedule. Not a big deal for me, other than the thumb twirling, but this was not a good first impression. Went upstairs to a room to get started. I was asked what kind of massage I wanted, to which I said deep pressure. I was asked if there was an area I needed extra time on. Okay, we're in the  zone here. I said back and shoulders. Then it started. The relaxing music was fine, but was interrupted by incoming phone calls to the device. No biggie...it's not like I need to reset the Enya to get my relax on...but the masseuse tried to keep massaging while messing with her phone. Weak. Actually, what was really weak was the level of pressure. Even though it was supposed to be deeper pressure, it was more like when TSA pats you down...but with lube. I will say that the hot stones were nice, but the primary thing I was looking for was to work out some knots. That did NOT happen. And the stones kept falling all over the place. *rattle* *clang* A highlight was the 45-second foot rub, which did feel good. *crash* (another stone falling) Overall I left feeling tight and disappointed.","9888":"I hate to be a negative Nel but this place sucks! \n\nA friend of mine suggested I try this place for lunch, the ratings were just ok but gave it a shot anyway. \nI ordered a carne asada taco salad, you know the kind with the crispy flour tortilla bowl? Needless to say it was a mini-me version of something that wanted to be worth the 9 bucks I paid! \nThe cook didn't even take time to slice the flavorless heap of meat that sat sadly on my iceberg. The person at the table next to me had a similar complaint except hers were tacos. \nThis place is frequented by lots of locals \nI can't figure out why...... is there a Gold Membership we don't know about????","1656":"My husband and  I recently went to Waverly's as we so often have done in the past.\nI ordered their 10 oz Sirloin Special expecting to get the same quality of meat and thickness that I had received in the past.  When i received my steak this time, it looked like a very \"thinly\" cut piece of breakfast steak.  I have eaten better looking steaks at a cheap buffet.  It looked as if they were running out of the special so they had to compensate with a cheaper cut.  If I would have known this to begin with I would have ordered something else.  I happen to like sirloins and believe me, you can get a much better steak from OUTBACK.\n\nWhen I brought this to the attention of the waiter and manager, they offhandedly said that I had received an end cut.  I I had a center cut of the sirloin like I did before, it would have been a thicker cut of meat.  Where is the quality control here?  One day you get a center cut and the next time you might get a breakfast steak????????????\nFor a self-proclaimed upscale restaurant, this should be inexcusable.  I was not offered an apology or compensated for an inferior and smaller cut of meat.  Needless to say, there are a hundred different steak restaurants in town and I will not be returning to Waverly's.","14148":"You get what you pay for here. $12 threading sounded great but left me HIGHLY disappointed. Twenty four hours later and my eyebrows still hurt, and I have multiple red cuts. When she showed me my eyebrows, there were multiple, obvious hairs still present. No soothing aloe or attempt to fix my eyebrows when finished. Worst eyebrow experience I've ever had!","12957":"I DO NOT recommend anyone here, especially tourists.  They might as well put up a big fat sign outside that says ENGLISH SPEAKERS ARE NOT WELCOMED. \n\nThis was my first stop after leaving the airport. I went up to the counter with a cheer and a simple but friendly bonjour to the older cashier.  I received a blank stare back and am immediately treated terribly as soon as she heard me speak English.  Yelling at me when I didn't understand her thick Vietnamese\/French accent in this noise filled restaurant, shaking her head in disgust, shoving the menu in my face in a rage, slamming my credit card and pen on the counter with purposeful force, letting the unsanitary credit card machine drop on top of my food, and not providing me with napkins while she did for other customers.  She has no business working in service with this poor attitude.  And this is coming from someone who lives in New York City.  I'm used to subpar service but she is on another level.","2823":"To those they helped...i'm glad for you. But you shouldn't say you are available 24\/7 days when you aren't. We needed someone at 330am yesterday when our very large dog was suffering & we couldn't move him. We called & got a recording that they weren't doing 24 hr service right now. There's only 2 places in town that claim they are 24hr at home care....well the other place isn't either.","3276":"We went to this place last night and we had a horrible experience. First we tried to access the other dance  floor and we were told that it was at  full capacity , but we noticed how the bouncer was letting in only people that he knew. Therefore I went up to him and his statement was !!! !!! Nothing !!!!!!! He did not know what to say when we asked. Second the bartender did not know how to make a whiskey sour and he was over changing us! We went to a different bartender at the end of the night and he charged us less! Very bad service!","3973":"730 start time is such a lie. Still waiting. Still not open at 8:30. They are the ones who told me to be here at eight.  I was hoping to make it to work on time looks like that's not going to happen.","7010":"Lets just start out by saying....years ago when you saw the word Cafe, you just knew the food was going to be great, the waitresses would greet you like they'd known you for years & the owner would be right there helping & making sure everyone felt welcome! This is not the case at this Cafe!!!! The older lady that seated us, was gruff, extremely rude & was very nasty to my husband & I with her tone of voice. Why would you own an eating establishment if you were not a people person? Doesn't make sense at all. This owner & I'm being more than polite, is an ASS!! I felt sorry for the staff & yes she spoke down to them too. So, the ONLY reason the Iowa Cafe even gets one star, is because of our waitress (Katie) who was soooo sweet & spoke to us like we were real people. THANK YOU KATIE, you are an angel. The Iowa Cafe should have a sign on the door that reads \"WARNING....ENTER AT YOUR OWN RISK, OWNER HAS HER HEAD UP HER ASS\"!!!!!","12940":"I had heard really good things about this restaurant and was looking forward to the experience. \n\nOrdered the platter but we did not get our food for 45 minutes. When we asked the waitress she seemed really surprised that it had been that long. She had only two tables to wait and was her job to follow up in the first place. Like she had no clue what was happening. Turns out that she completely didnt put the order though at all. \n\nThis is especially bad considering that we were the only second table in the restaurant. We saw that everyone else that came after us get their food. When the waitress  followed up with the kitchen she did not even inform us of what had happened  and my husbabd had to ask the second time walking up to her. She tried to brush it off saying 10 minutes  but finally admitted that she did not put the order through and now it had been an hour since the ordered time and my kids were starving.\n\nThe food that finally came out after an hour and it was so rushed i could tell.\n\nNo formal apologies and no offer of any gestures.\n\nExtremely disappointed with forgetting to put order in in the first place but worst part was how that mistake was handled","1410":"Closed Tuesdays fix that on your yelp and the location hours even if it is a \"summer\" thing.","8026":"Not shocked this place closed.  The paella was HORRIBLE.  Actually they said it was paella, and I ordered paella, but I've never had what they call paella.  It sure didn't match what I know as paella and what they even showed on their website.  Good riddence!","10850":"A group of us checked into this place this past Friday night. We were staying at the bellagio and thought we wanted a loungey place to hang out for the night as opposed to a club. We walked by Caramel, it looked nice enough, so we entered the place. \n\nLet me just start out by saying, I love lounges with plush-modern furniture. This place had that, but that's all it had. \n\nThe staff was pretentious and made us feel really uncomfortable. Instead of the energy screaming welcome, sit down and have a drink. It was more like, order, tip and get out. \n\nFirst, I could not believe the prices. $10 beers and $15 cocktails Yes, I know we were at the Bellagio, but geez...really? This is Las Vegas, not Manhattan or San Francisco. \n\nSecond, the bouncer carded my 55 year old step-dad and when he said his ID was in the room, security wouldn't let him in. I understand that in the abundance of caution, you have a policy that you card everyone, but shouldn't management give their staff just a little bit of flexibility to use some common sense. \"Hmmm, man with bald head and a gray mustache....who's old enough to be your dad, why not let this guy in??!?\" \n\nFinally, the real reason I felt it necessary to give this place just one star (as opposed to two) besides everything I've already said. After our first round of drinks, we asked for some water. So, that we could hydrate for the next round. The place would not give us water - period. Unless, we shelled out $5 a bottle per person!! Insane. No other lounge in the Bellagio has this policy. \n\nSo, to make a long story somewhat short. We asked for a cup of ice, sucked that down and walked out . We went across the casino to another lounge and got our second, third and fourth round of drinks with cups of water each time. It's the principal.","874":"Drove so far to try this place with great reviews. Sadly, my Da Surf Rider plate was pretty disappointing.","10689":"Wife and I waited 10 mins at the end of the bar, a small crowd of about 10 at the other end but we were never even acknowledged by either the guy or the girl behind the bar. Obvious that that the bartenders were lost, so we walked out. Oh well.","13965":"i was in Las Vegas for work and wanted to stay near my account , which was near the airport. I usually pick a Hilton property because I am a Diamond member. I greatly appreciated an early check in because i did not have to be at my account until later in the day. the day The night of the day i checked out i realized I had forgotten my Bose headphones. I immediately called the hotel and was told housekeeping was closed and there was no one to access the locked lost and found. They directed me to the voice mail which was full and wouldn't accept new messages. I called in the AM the next day and again was directed to a housekeeping phone with full messages. I asked to talk to a manager he took my name and number and said he would check Skip ahead to 1.5 weeks later and 2 manager calls( one went to voicemail) and still no response. Not sure why this hotel has such a disrespectful person managing but i suspect he would do a better job at a Dollar general. Would not recommend the hotel or inept manager.","10525":"I used to love ordering Barro's when I was in town. Now every time there is an issue with the order. Manager calls it will be late but we are redoing your order. Ok good thank you. But I doubt that happened. The ranch for the wings was hotter than the wings. Last time I order from them.","11116":"Service was good, ambience nice\nFood lousy. Way too salty. 65 dollar steak and they don't know how to cook","6537":"What is the hype people????I went here for lunch after seeing all the awesome  reviews, but I was disappointed. First, the menu is very hard to understand (see the pic that someone posted). I ordered the chicken shwarma sandwich and hummus platter. There isn't much of a drink selection in the tiny fridge. For soda, all they had was the cans and they charged $1.00 for them. Later, while I was eating I noticed a lot of people were buying their drinks from the market, then coming over to order their food (pain in the ass if you ask me). Anyhow, so I was only 1 of a few people there and the food took quite a while. When they finally called my order I went up and asked for the \"garlic sauce\" that I heard so much about on here and the lady said it would cost $1.00. I said nevermind because I wasn't going to pay that for a small container of condiment! I was surprised at how small the sandwich was. It wasn't  impressive either. Just a grilled flatbread with a few pieces of  chicken, a few tomato slices, lettuce, and a little sauce. In my opinion this wasn't worth 3.99, but more worth 2.50 or something because of its size and how little filling there was.The hummus was good, but  nothing spectacular. This place is also in a dodgy part of town right across from project housing...literally right across the street. The market was pretty cool though and I'll prob return (during the daylight of course) for some olives, olive oil, and pita. BUT will skip out on dining here.","242":"Arrived for lunch at 1:05 with about 30 patrons currently seated.  Our waitress was polite, but not prepared to answer my question as to what the soup option was.  And she did not offer to find out, just a reply of \"I do not know\".  After 20 mins I had to ask another waitress for help in finding our order because we could find our waitress. \n\nOne of meals arrived with an incorrect side, which was quickly replaced.  We asked waitress to remember to not charge us for it.  She returned to tell us she did, but that substitutions were not allowed for this meal, but they would allow it this time.  Really!  She could have told us ahead of time?  And her tone was of blaming us.  \n\nWe have been here 2 times in past few weeks.  Each time during lunch  and each time order took a long time and came with errors.","15195":"I have never had such a bad experience dining in a restaurant as I have with this steakhouse. We came with a party of 15 people which, originally, was supposed to be 20 people. At the end of the meal they put the cheque as a single one, which wasn't really an issue since we expected that, but we also noticed a $300 surcharge on top of an already $1000 bill!! We asked why they put that there and they said that because some of the party members didn't show up they had to \"make up for the lost profit for the scheduled staff and the room we put aside for the party. There is also an average of each person spending $100 and we were expecting your table to average $2000. Sorry but this is business.\" I'm sorry but what sort of restaurant does this without first telling their customers? Their reasoning is also a load of BS because they put their business expectations on the customer rather than anticipating that maybe some people don't show up when there is a party like other normal and decent restaurants do. \n\nNow, they put this on the bill and did not mention this the first time when we called them to reserve for the party, nor the second time we called to tell them that there would be less people coming. They did not have this policy on their website either and the bill had the number 15 printed on the bottom for the number of people. \n\nHad this not happened I would have rated the restaurant much higher because the food was actually decent (though really not worth the price in my opinion). However, the trick with the $300 was such an underhanded and disgusting practice that I don't recommend this place to anyone, nor will I ever, and will find a way to let the business bureau know so that they cannot do this to other people. Our party was fortunate because we had someone contest the bill on our behalf but I am so sure that they have gotten away with this in the past with other poor victims. \n\nMy final advice: stay away from this place and go to a McDonald's instead if you can because at least at McDonald's they don't try to pull this mess  with you.","6906":"This place is overpriced, management is super unfriendly, not happy about the food either. If you are in Berea you're better off going literally anywhere else. Takes forever to get recognized when you walk in and when you sit down you're not even greeted for another 15 minutes, and as a waitress myself, that makes me cringe. Would not send friends this way. Only to maybe grab a cup of coffee through the drive through so you don't have to go inside and actually receive the bad service.","10842":"Terrible service. Tables after us got their orders before us. We were told different orders which is why ours was taking 15 minutes longer. Not sure why they would lie when the neighbouring tables  had similar orders. I was also told fried chicken takes longer to make? Table next to us got that too! Disgruntled and annoyed that there wasn't even an apology. Worst Banh Mi Boyz service ever experienced. Maybe the staff here needs customer service training.","4264":"Came all the way from downtown. Food is better than the ones in dt. But TERRIBLE SERVICE. Be prepared to WAIT FOR MORE THAN ONE HOUR if you're going. \n\nBy kept telling us someone is making the payment, they kept my group waiting for 1.5 hours standing at the door. Instead of an apology, the manager taught us to understand because it was busy when we were trying to tell him what has happened on us. \n\nOk the story is we tried to book a table for 930pm and were told that it won't take long if we just show up at the store. Since there's usually not many large groups at that time, therefore a reservation is not necessary. \nThey told us that there was only one group before us upon our arrival and kept telling us someone is making the payment and will leave SOON. We were not seated until waiting for 1.5 hrs. \nJust 30 mins later we were told that it was our last call. When we were trying to tell them what has happened, the \"manager\" came and said it's just really BUSY and you have to understand. When we asked for more ice-cream the manager told us that there is only four left. And those were for the other table beside us. Therefore we kindly saved the dessert for the others and left.","12968":"Disgusting pizza. Cardboard crust, extremely greasy, cheap tasting ingredients. Large pizza so one fills you up, but you don't even want to eat it after you've had a few bites. Would not be coming back.","8949":"yuck. portions are tiny and food is not fresh.  this place is overpriced as hell and simply do not know how to make poke. if you call putting together some mushy rice and unfresh fish a poke bowl then i guess anyone can make it at home. do not recommend, would not come back.","3763":"Very disappoint with this place!!! My wife and I went there for afternoon tea with our service dog and they refuse to give us service cause we have a service dog.  We were basically told to leave!   I told the owner that they cannot refuse service to us in an establishment under the Toronto bylaw.  They say they don't know anything about this service dog bylaws.  I even show them the actual laws from the city of Toronto bylaws webpage and they still don't understand. \nWell, I guess they lose us as regular customers from now on.  We will never go there again with that kind of ignorance! \nToo bad I can't give them a negative stars rating.","4282":"DON'T DO BUSINESS WITH THEM. They messed up our order. Then tried to charge us for their mistake. They said 30 minutes. 1hour later food came. It was missing a whole meal. When we called they said they would send one out. Then called back and tried to charge for their mess up. HORRIBLE CUSTOMER SERVICE!!!!!!!","1333":"Tech sent had to come back and fix his work. Both times the same tech was a total schmuck to my wife. condescending, not very good at quality... mostly if they replaced the dirtbag late 80's ex rocker for a tech, i could deal with the work. But until they get rid of the singular tech that is running their company into the ground, their review will not improve. \n\nAfter investing thousands with this company, i would never return to them again. Lesson = learned.","4872":"Came for the clean bar, the TVs and good food. Left after 1 drink because of the terrible service from Dawn. Will avoid her shift and leave when she's working. Rude and leaves you to basically get your own drinks."},"date":{"923":1246550755000,"8689":1283551444000,"11992":1312756337000,"490":1497900297000,"3050":1499461549000,"6792":1471548449000,"677":1301265753000,"14715":1458147563000,"5568":1538624253000,"12454":1531769905000,"3764":1403022294000,"6410":1421895585000,"1059":1435937645000,"13330":1449367691000,"5776":1501742197000,"7376":1537973975000,"14229":1476811573000,"6023":1505852261000,"3383":1520217974000,"1850":1531868821000,"7345":1478909625000,"9888":1434094719000,"1656":1363527969000,"14148":1520532361000,"12957":1536859336000,"2823":1371841852000,"3276":1491748969000,"3973":1494121561000,"7010":1520874003000,"12940":1535910591000,"1410":1534902310000,"8026":1272858849000,"10850":1262129514000,"874":1433469848000,"10689":1497230510000,"13965":1523295853000,"10525":1512859635000,"11116":1464399524000,"6537":1269541115000,"242":1496944421000,"15195":1538917789000,"6906":1458919331000,"10842":1470074854000,"4264":1424630791000,"12968":1539287295000,"8949":1514926963000,"3763":1431899842000,"4282":1393024071000,"1333":1365436031000,"4872":1506874756000}}